FILES/Catalogs/ФункцииОписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ФункцииОписания</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодФункции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФункции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихФукций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/Catalogs/ФункцииОписания/Ext/ManagerModule.bsl
Функция ЗагрузитьПредопределенныеЗначения() Экспорт
	
	Макет = Справочники.ФункцииОписания.ПолучитьМакет("ПредопределенныеЗначения");
	
	ТекущаяСтрока = 1;
	ВыполнятьЗагрузку = Истина;
	Пока ВыполнятьЗагрузку Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		ИмяПредопределенного = Макет.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1).Текст;
		Наименование = Макет.Область(ТекущаяСтрока, 2, ТекущаяСтрока, 2).Текст;
		ТипФункции = Макет.Область(ТекущаяСтрока, 3, ТекущаяСтрока, 3).Текст;
		КодФункции = Макет.Область(ТекущаяСтрока, 4, ТекущаяСтрока, 4).Текст;
		
		Если ИмяПредопределенного = "" Тогда
			ВыполнятьЗагрузку = Ложь;
		Иначе
			Попытка
				//Метаданные.Справочники.ФункцииОписания.Предопределенные
				ЭлементСправочника = Справочники.ФункцииОписания[ИмяПредопределенного].ПолучитьОбъект();
				ЭлементСправочника.Наименование = Наименование;
				ЭлементСправочника.ТипФункции = Перечисления.ТипыВнешнихФукций[ТипФункции];
				ЭлементСправочника.КодФункции = КодФункции;
				ЭлементСправочника.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
КонецФункции
